# FilterCategoryRule Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterCategoryRule Constructor
FilterCategoryRule Class See Also
---
Constructs a new instance of FilterCategoryRule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public FilterCategoryRule(
	ICollection<ElementId> categories
)
```

Visual Basic
---
```text
Public Sub New ( _
	categories As ICollection(Of ElementId) _
)
```

Visual C++
---
```text
public:
FilterCategoryRule(
	ICollection<ElementId^>^ categories
)
```

# ### Parameters
categories
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> The set of categories.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FilterCategoryRule Class
Autodesk.Revit.DB Namespace